{
    "name": "Ethan Ribeiro",
    "email": "ethanribeiro101@gmail.com",
    "headshot": "https://imgur.com/J2xiYMF",
    "bio": "Ethan Ribeiro graduated from Assabet Valley Regional Technical High School in 2021, where he specialized in CPWD (Computer Programming & Web Development/Design) with outstanding academic and shop grades. During his junior year of high school and beyond, he embarked on a journey as a freelance web developer, collaborating with various companies, including ODINJ (Optimum Diagnostic Imaging), Cranio Associates, Holistic Manual Physical Therapy, and The Randolph Bulldogs Football for SHG Sports Productions. In his role as a freelance web developer, he adeptly honed his skills in HTML, CSS, and delved into foundational JavaScript. His experience extended to mastering WordPress, utilizing PHP, managing WordPress packages, pages, and plugins. He also ventured into Wix for website creation, design, and publication. The year 2022 saw him as a web developer intern at 1 Stop Design Shop, contributing to projects like Winbrook, Montilios, and the company's official website. Here, he elevated his skill set, grasping advanced HTML and CSS techniques, refining his work efficiency, and gaining hands-on expertise in cPanel-based website management. Following this enriching internship, Ethan joined Avatar Computing INC, where he continued his journey of skill refinement as a Jr. Software Developer. Here, he delved deeper into WordPress, enhancing his ability to create data-driven dynamic websites. He revisited cPanel to manage websites effectively. He gained competence in handling backup files, seamlessly navigating AWS, SharePoint, and OneDrive for storage and retrieval. His tenure with Avatar Computing INC paved the way for Ethan to pursue his passion further. This led him to enroll in General Assembly, where he immersed himself in advanced studies to earn certification as a software engineer. Ethan's journey showcases his unwavering commitment to the world of web development and software engineering. From his formative freelance experiences to his transformative roles at various companies, he continues to push boundaries, seeking to enhance his craft and contribute value to the dynamic landscape of technology."
}